### [DataFrame 연산 - 2]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- DataFrame과 숫자데이터 연산 수행

In [1]:
# [1] 모듈 로딩
import pandas as pd

In [2]:
# [2] 데이터 준비
data={'A':[98,78,100,52],
      'B':[90,70,10,50]}

In [4]:
# [3] Dict 데이터 ==> DataFrame으로 저장
DF1=pd.DataFrame(data)
DF2=DF1/4

In [5]:
print(DF1, DF2, sep='\n\n')

     A   B
0   98  90
1   78  70
2  100  10
3   52  50

      A     B
0  24.5  22.5
1  19.5  17.5
2  25.0   2.5
3  13.0  12.5

In [6]:
# [4] 연산 수행
# - 산술연산
DF1 - DF2

      A     B
0  73.5  67.5
1  58.5  52.5
2  75.0   7.5
3  39.0  37.5

In [9]:
# - 비교연산
DF1<=DF2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [14]:
# [5] 연산수행 => DataFrame과 Series
# - 산술연산
# - 'A'컬럼만 추출
SR1=DF1.A
SR1, SR1.index

(0     98
 1     78
 2    100
 3     52
 Name: A, dtype: int64,
 RangeIndex(start=0, stop=4, step=1))

In [15]:
DF2+SR1

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [17]:
# [방법1] SR ==> DF으로 변환
SRDF=SR1.to_frame()
SRDF

     A
0   98
1   78
2  100
3   52

In [18]:
DF1+SRDF

     A   B
0  196 NaN
1  156 NaN
2  200 NaN
3  104 NaN

In [19]:
DF1+SR1.T

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [25]:
# DF1.columns=[0,1]
DF1.T

    0   1    2   3
0  98  78  100  52
1  90  70   10  50

In [26]:
SR1, SR1+DF1.T

(0     98
 1     78
 2    100
 3     52
 Name: A, dtype: int64,
      0    1    2    3
 0  196  156  200  104
 1  188  148  110  102)